app/views/polls/index.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 29
---
				Answers:
				<% question.answers.each do |answer| %>