app/views/polls/show.html.erb

<br>
	<%= link_to "Take Poll", question_path(@poll.questions.first) %><br>
---
SELECT "questions".* FROM "questions" WHERE "questions"."poll_id" = 17 LIMIT 1