app/controllers/answers_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "30"]]
INSERT INTO "answers" ("check", "created_at", "question_id", "statement", "updated_at") VALUES (?, ?, ?, ?, ?)  [["check", nil], ["created_at", Tue, 31 Jul 2012 17:42:04 UTC +00:00], ["question_id", 30], ["statement", "asdsad"], ["updated_at", Tue, 31 Jul 2012 17:42:04 UTC +00:00]]
SELECT "polls".* FROM "polls" WHERE "polls"."id" = 18 LIMIT 1
SELECT "questions".* FROM "questions" WHERE "questions"."poll_id" = 18
---
  def create
    @question = Question.find(params[:answer][:question_id])
    @answer = @question.answers.new(params[:answer])
    @answer.save
    if next_question = @question.poll.find_next(@question)