app/controllers/polls_controller.rb

  def create
    @poll = Poll.new(params[:poll])
    @poll.save
---
INSERT INTO "polls" ("created_at", "link", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 30 Jul 2012 18:22:05 UTC +00:00], ["link", nil], ["name", "Cole World"], ["updated_at", Mon, 30 Jul 2012 18:22:05 UTC +00:00]]

  def edit
    @poll = Poll.find(params[:id])
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", "17"]]

  def show
    @poll = Poll.find_by_link(params[:link])
---
SELECT "polls".* FROM "polls" WHERE "polls"."link" = '1767694321' LIMIT 1

  def index
    @poll = Poll.find(params[:id])
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", "17"]]