app/controllers/polls_controller.rb

  def show
    @poll = Poll.find(params[:id])
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", "4"]]