app/controllers/polls_controller.rb

  def index
    @polls = Poll.all
---
SELECT "polls".* FROM "polls"