app/controllers/questions_controller.rb

SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", "17"]]
INSERT INTO "questions" ("created_at", "poll_id", "prompt", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 31 Jul 2012 17:35:13 UTC +00:00], ["poll_id", 17], ["prompt", "jlklk?"], ["updated_at", Tue, 31 Jul 2012 17:35:13 UTC +00:00]]
---
  def create
    @poll = Poll.find(params[:question][:poll_id])
    @question = @poll.questions.new(params[:question])
    @question.save

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "28"]]
DELETE FROM "questions" WHERE "questions"."id" = 28
---
  def destroy
    @question = Question.find(params[:id])
    @poll = @question.poll
    @question.delete